<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
    <%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
    <%@ taglib prefix="spring" uri="http://www.springframework.org/tags/form" %>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>회원가입</title>
<c:import url="../template/bootStrap.jsp"></c:import>
<style type="text/css">
	.agree{ width:1200px; position:relative; }
	h3 {display:block; font-weigth:bold;}
	.agree textarea {width:100%; padding:15px 0; font-size:13px; color:#999; line-height: 25px; height: 190px; border-left-width:0; border-right-width: 0; border-top:1px solid #7e7e7e; border-bottom:1px soid #e5e5e5;}
</style>
</head>
<body>
<c:import url="../template/header.jsp"></c:import>
<c:import url="../template/subtitle.jsp"></c:import>

<div class="container agree">
	<h3>이용약관</h2>
	<textarea >
		셀프스토리 회원가입 및 약관
제1장 총 칙

제1조 목 적
이 약관은 상관행 전기통신 사업법 및 동법 시행령에 의하여 셀프스토리 (이하 "회사")가 제공하는
셀프스토리(이하 "서비스")의 이용조건 및 절차에 관한 기본적인 사항을 목적으로 합니다.

제2조 약관의 효력과 변경
 (1) 이 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로 회원에게 공지함으로써 효력을 발생합니다.
 (2) 회사는 영업상 중요사유가 있을 때 약관을 변경할 수 있으며, 변경된 약관은 전항과 같은 방법으로 효력을 발생합니다.
 (3) 일반회원 혹은 특별회원은 변경된 약관 사항에 동의하지 않으면 서비스 이용을 중단하고 이용계약을 해지할 수 있습니다. 약관의 효력발생일 이후의 계속적인 서비스 이용은 약관의 변경사항에 동의한 것으로 간주됩니다.

제3조 약관 외 준칙
   이 약관에 명시되지 아니한 사항에 대해서는 상관행 전기통신기본법,전기통신사업법 및 기타 관계법령의 규정에 의합니다.

제2장 회원 가입과 서비스 이용

제1조 이용 계약의 성립
 (1) 이용 계약은 이용자의 이용 신청에 대한 회사의 이용 승낙과 이용자의 약관 내용에 대한 동의로 성립됩니다. 
 (2) 회원에 가입하여 서비스를 이용하고자 하는 희망자는 회사에서 요청하는 개인 신상 정보를 제공해야 합니다.
 (3) 회사는 다음 각 호에 해당하는 이용계약신청에 대하여는 이를 응낙하지 않습니다.
       ● 다른 사람의 명의를 사용하여 신청하였을 경우 
       ● 이용 계약 신청서의 내용을 허위로 기재 하였거나 허위서류를 첨부하여 신청했을 경우 
       ● 사회의 안녕 질서 혹은 미풍양속을 저해할 목적으로 신청하였을 경우

제2조 서비스 이용
 
 (1) 서비스 이용은 국가가 지정한 공휴일을 제외한 월요일~금요일을 원칙으로 합니다.

 (2) 회원의 게시물 회사는 회원이 게시하거나 등록하는 서비스내의 내용물이 다음 각 호에 해당한다고 판단되는 경우에 사전 통지 없이 삭제할 수 있습니다. 
     1) 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용인 경우 
     2) 공공질서 및 미풍양속에 위반되는 내용인 경우 
     3) 범죄적 행위에 결부된다고 인정되는 내용인 경우 
     4) 회사의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우 
     5) 불건전한 자료를 홍보할 경우 
     6) 기타 관계법령에 위반된다고 판단되는 경우  
   
 (3) 게시물의 저작권  
서비스에 게재된 자료에 대한 권리는 다음 각 호와 같습니다. 
1) 게시물에 대한 권리와 책임은 게시자에게 있으며 회사는 게시자의 동의 없이는 이를 서비스 내 게재 이외에 영리적 목적으로 사용할 수 없습니다. 단, 비영리적인 경우에는 그러하지 아니하며 또한 회사는 서비스내의 게재권을 갖습니다. 
2) 회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 자료를 상업적으로 사용할 수 없습니다  
    
 (4) 서비스 제공의 중지
     회사는 다음 각 호에 해당하는 경우 서비스 제공을 중지할 수 있습니다. 
     1) 서비스용 설비의 보수 등 공사로 인한 부득이한 경우 
     2) 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우 
     3) 기타 불가항력적 사유가 있는 경우


제3장 책 임

제1조 회사의 의무
  (1) 회사는 특별한 사정이 없는 한 이용자가 신청한 서비스 제공 개시일에 서비스를  이용할 수 있도록 합니다.
  (2) 회사는 이 약관에서 정한 바에 따라 계속적 또는 안정적 으로 서비스를 제공할  의무가 있습니다.
  (3) 회사는 이용자의 개인신상정보를 본인의 승낙없이 타인에게 누설, 배포하여서는 안됩니다. 다만, 전기통신 관련법령등 관계법령에 의하여 관계 국가기관등의 요구가 있는 경우에는 그렇지 않습니다.
  (4) 회사는 이용자로부터 제기되는 의견이나 불만이 정당하다고 인정할 경우에는 즉시 처리하여야 합니다. 다만, 즉시 처리가 곤란한 경우에는 이용자에게 그 사유와 처리일정을 통보하여야 합니다.

제2조 이용자의 의무
  (1) 아이디와 비밀번호에 관한 모든 관리의 책임은 이용자에게 있습니다.
  (2) 자신의 아이디가 부정하게 사용된 경우,이용자는 반드시 당사에 그 사실을 통보해야 합니다.
  (3) 이용자는 이 약관 및 관계법령에서 규정한 사항을 준수 하여야 합니다.

제4장 이용자 해지 신청 및 변경

제1조 계약 해지 및 이용제한
      이용자가 이용 계약을 해지하고자 하실 때에는 이용자  본인이 직접 온라인을 통해 해지 신청을 하여야 합니다. 회사는 이용자가 다음 사항에 해당하는 행위를 하였을 경우 사전 통지 없이 이용 계약을 해지하거나 또는 기간을 정하여 서비스 이용을 중지할 수 있습니다.
      (1) 공공 질서 및 미풍양속에 반하는 경우.
      (2) 범죄적 행위에 관련되는 경우.
      (3) 이용자가 국익 또는 사회적 공익을 저해할 목적으로 서비스 이용을 계획 또는 실행할 경우.
      (4) 타인의 서비스 아이디 및 비밀 번호를 도용한 경우.
      (5) 타인의 명예를 손상시키거나 불이익을 주는 경우.
      (6) 같은 사용자가 다른 아이디로 이중 등록을 한 경우.
      (7) 서비스에 다른 피해를 가하는 등 서비스의 건전한 이용을 저해하는 경우.
      (8) 기타 관련법령이나 회사가 정한 이용조건에 위배되는 경우.

제2조 이용 정지
      (1) 회사는 제4장 제1조의 규정에 의하여 이용제한을 하고자 하는 경우에는 그 사유, 일시 및 기간을 정하여 서면,E-Mail 또는 전화 등의  방법에 의하여 해당 이용자 또는 대리인에게 통지합니다. 다만, 회사가 긴급하게 이용을 정지할 필요가 있다고 인정하는 경우에는 통지하지 아니합니다.
      (2) 제1항의 규정에 의하여 이용정지의 통지를 받은 이용자 또는 그 대리인은 그 이용 정지의 통지에 대하여 이의가 있을 때에는 이의신청을 할 수 있습니다.
      (3) 회사는 제2항의 규정에 의한 이의신청에 대하여 그 확인을 위한 기간까지 이용정지를 일시 연기할 수 있으며,그 결과를 이용자 또는 그 대리인에게 통지합니다.
      (4) 회사는 이용정지 기간 중에 그 이용정지 사유가 해소된 것이 확인된 경우에는 이용 정지 조치를 즉시 해제합니다. 

제5장 계약변경 

제1조 계약사항의 변경
     (1) 이용자는 주소 또는 은행 계좌번호 등 이용계약 내용을 변경하거나,서비스를 해지할 경우에는 전화나 온라인을 통해서 이용계약을 변경/해지하여야 합니다.

제6장 정보의 제공

제1조 정보의 제공
      회사는 이용자가 서비스이용 중 필요가 있다고 인정되는 다양한 정보에 대해서는 전자우편이나 서신우편 등의 방법으로 이용자에게 제공할 수 있습니다.
제2조 광고의 제공
      회사는 광고주로부터 요청 받은 광고를 E-Mail을 통하여 회원에게 제공할 수 있다.

제7장 손해 배상 등
   
   제1조 손해 배상
   회사는 서비스 이용과 관련하여 무료 서비스의 경우에 한하여 회원에게 발생한 어떠한 손해에 관하여도 책임을 지지 않습니다.
   
   제2조 면책 조항
    1. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임을 지지 않습니다. 
    2. 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다. 
    3. 회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며 그밖에 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 않습니다. 
    4. 회사는 회원이 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 관하여는 책임을 지지 않습니다. 

   제3조 관할법원 
       서비스 이용으로 발생한 분쟁에 대해 소송이 제기될 경우 회사의 본사 소재지를 관할하는 법원을 관할 법원으로 합니다.  

(부칙)
* 이 약관은 2017년 8월 1일부터 적용됩니다.
* 회원가입은 본인 가입을 원칙으로 하며, 만약 허위 가입 적발시 적립금 회수는 물론, 제명 처리됨을 알려 드립니다.  
			
	</textarea>
	<p style="text-align:center">
		<input type="checkbox" id="check">
		<label for="check">위의 이용약관의 내용을 읽었으며, 이에 동의합니다.</label>
	</p>
</div>
<div class="container agree">
	<h3>개인정보취급방침</h2>
	<textarea >
		* 개인정보의 수집.이용목적
  서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산,회원제 서비스 이용에 따른 본인확인, 개인식별
  불량회원의 부정이용 방지와 비인가 사용방지, 서비스 이용 안내 및 메일링, 메세지 전송
  

* 수집하는 개인정보의 항목
  회원가입 시 : 이름, 로그인ID, 비밀번호, 휴대전화번호, 이메일, 서비스 이용기록, 접속 로그, 결제기록 
  

* 마케팅 및 광고에 활용

  신규 서비스(제품) 개발, 이벤트 등 광고성 정보 전달, 회원특성에 따른 서비스 제공, 회원의 서비스 이용에 대한 통계


* 개인정보의 보유 및 이용 기간
  회원탈퇴 또는 개인정보 수집 및 이용목적이 달성된 후에는 해당정보를 지체 없이 파기합니다.
  다만, 서비스의 부정/불량이용자의 재가입 방지를 위해 해지 후 3 개월간 보유할 수 있으며 전자상거래에서의 소비자보호에 관한 법률 등 타 법률에 의해 보존의무가 있는 경우에는 법령이 지정한 일정기간 보존합니다.
        
  단, 상법 등 관련법령의 규정에 의하여 다음과 같이 거래 관련 권리 의무 관계의 확인 등을 이유로 일정기간 보유하여야 할 필요가 있는 경우에는 일정기간 보유합니다.

  계약 또는 청약철회 등에 관한 기록 보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률 보존 기간 : 5년
  대금결제 및 재화 등의 공급에 관한 기록 보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률 보존 기간 : 5년
  전자금융 거래에 관한 기록 보존 이유 : 전자금융거래법 보존 기간 : 5년
  소비자의 불만 또는 분쟁처리에 관한 기록 보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률 보존 기간 : 3년
  웹사이트 방문기록 보존 이유 : 통신비밀보호법 보존 기간 : 3개월
	</textarea>
	<p style="text-align:center">
		<input type="checkbox" id="check2">
		<label for="check2">위의 개인정보취급방침의 내용을 읽었으며, 이에 동의합니다.</label>
	</p>
</div>
<div class="container">
		<h3> Member Join Page</h3>
		<form action="memberJoin" method="post">
		<!-- path는 parameter 이름!! -->
		<div class="form-group">
		<label for="id">id </label>
		<input type="text" id="id" class="form-control"/>
		
		</div>
		
		<div class="form-group">
		<label for="pw">PW </label>
		<input type="text" id="pw" class="form-control"/>
	
		</div>
		
		<div class="form-group">
		<label for="pw">PW </label>
		<input type="text" id="pw2" class="form-control"/>
		
		</div>
		
		<div class="form-group">
		<label for="name">name </label>
		<input type="name" id="name" class="form-control"/>
		
		</div>
		
		
		<div class="form-group">
		<label for="email">Email </label>
		<input type="email" id="email" class="form-control"/>
		
		</div>
		</form>
		<button id="btn-save" class="btn btn-warning">회원가입</button>
	</div>
	
	
	<script type="text/javascript">
	function init(){
		$("#btn-save").on("click", ()=>{
			this.save();
			});
	}

		function save() {
			//alert("user의 save 함수");
			let data ={
				id: $("#id").val(),
				pw: $("#pw").val(),
				name:$("#name").val(),
				email: $("#email").val()
					};
			//console.log(data); ->자바스크립트 오브젝트
			//ajax통신을 이용해서 파라미터(데이터)를 json으로 변경하여 insert요청.
			$.ajax({
				type: "POST",
				url:"/api/member",
				data: JSON.stringify(data), //위에 data 객체를 java로 보낼 때 json으로 변경해서 보내야함. http body 데이터!
				contentType: "application/json; charset=utf-8", // body데이터가 어떤 데이터타입인지 알려주는 것
				dataType: "json" //요청을 서버로해서 응답이 왔을 때 기본적으로 모든 것이 string인 json형식으로 오는데 =>javascript 오브젝트로 변환시켜줌
				}).done(function(response){
					alert("회원가입이 완료되었습니다");
					alert(response);
					location.href="/";
						}).fail(function(error){
								alert(JSON.stringify(error));
								});  
		}

		init();
	</script>
</body>
</html>